fio_test/log/128k/128k_rand_randread_22job_QD1.log
libpmem: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 22 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=22): err= 0: pid=42062: Fri Mar  5 04:59:59 2021
  read: IOPS=394k, BW=48.1GiB/s (51.6GB/s)(14.1TiB/300002msec)
    clat (usec): min=5, max=4305, avg=54.86, stdev= 4.68
     lat (usec): min=5, max=4306, avg=54.89, stdev= 4.68
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   51], 20.00th=[   52],
     | 30.00th=[   53], 40.00th=[   53], 50.00th=[   55], 60.00th=[   56],
     | 70.00th=[   57], 80.00th=[   58], 90.00th=[   61], 95.00th=[   63],
     | 99.00th=[   68], 99.50th=[   70], 99.90th=[   79], 99.95th=[  101],
     | 99.99th=[  194]
   bw (  MiB/s): min=21757, max=49559, per=100.00%, avg=49336.36, stdev=53.05, samples=13156
   iops        : min=174049, max=396472, avg=394690.80, stdev=424.44, samples=13156
  lat (usec)   : 10=0.01%, 20=0.01%, 50=5.23%, 100=94.72%, 250=0.05%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=99.82%, sys=0.03%, ctx=4305, majf=0, minf=45760
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=118204519,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=48.1GiB/s (51.6GB/s), 48.1GiB/s-48.1GiB/s (51.6GB/s-51.6GB/s), io=14.1TiB (15.5TB), run=300002-300002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%