fio_test/log/128k/128k_rand_randread_24job_QD1.log
libpmem: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 24 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=24): err= 0: pid=42167: Fri Mar  5 05:07:28 2021
  read: IOPS=390k, BW=47.6GiB/s (51.2GB/s)(13.0TiB/300001msec)
    clat (usec): min=6, max=4284, avg=60.36, stdev= 5.39
     lat (usec): min=6, max=4285, avg=60.39, stdev= 5.39
    clat percentiles (usec):
     |  1.00th=[   54],  5.00th=[   55], 10.00th=[   56], 20.00th=[   57],
     | 30.00th=[   58], 40.00th=[   59], 50.00th=[   60], 60.00th=[   61],
     | 70.00th=[   63], 80.00th=[   64], 90.00th=[   67], 95.00th=[   69],
     | 99.00th=[   74], 99.50th=[   77], 99.90th=[   91], 99.95th=[  121],
     | 99.99th=[  212]
   bw (  MiB/s): min=20448, max=49098, per=100.00%, avg=48812.52, stdev=52.02, samples=14352
   iops        : min=163584, max=392784, avg=390492.51, stdev=416.19, samples=14352
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=99.92%, 250=0.07%
  lat (usec)   : 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=99.81%, sys=0.03%, ctx=4427, majf=0, minf=49920
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=117091806,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=47.6GiB/s (51.2GB/s), 47.6GiB/s-47.6GiB/s (51.2GB/s-51.2GB/s), io=13.0TiB (15.3TB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%