fio_test/log/128k/128k_rand_randread_26job_QD1.log
libpmem: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 26 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=26): err= 0: pid=42268: Fri Mar  5 05:13:55 2021
  read: IOPS=366k, BW=44.7GiB/s (47.0GB/s)(13.1TiB/300001msec)
    clat (usec): min=11, max=4413, avg=69.75, stdev=17.56
     lat (usec): min=11, max=4414, avg=69.79, stdev=17.57
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   58], 10.00th=[   59], 20.00th=[   61],
     | 30.00th=[   62], 40.00th=[   64], 50.00th=[   65], 60.00th=[   67],
     | 70.00th=[   69], 80.00th=[   71], 90.00th=[   78], 95.00th=[  120],
     | 99.00th=[  135], 99.50th=[  143], 99.90th=[  157], 99.95th=[  165],
     | 99.99th=[  237]
   bw (  MiB/s): min=19767, max=46099, per=100.00%, avg=45846.77, stdev=43.75, samples=15548
   iops        : min=158136, max=368798, avg=366773.49, stdev=349.98, samples=15548
  lat (usec)   : 20=0.01%, 50=0.01%, 100=91.11%, 250=8.89%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=99.80%, sys=0.03%, ctx=4654, majf=0, minf=54081
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=109832243,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=44.7GiB/s (47.0GB/s), 44.7GiB/s-44.7GiB/s (47.0GB/s-47.0GB/s), io=13.1TiB (14.4TB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%