fio_test/log/128k/128k_rand_randread_30job_QD1.log
libpmem: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 30 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=30): err= 0: pid=42480: Fri Mar  5 05:28:27 2021
  read: IOPS=362k, BW=44.1GiB/s (47.4GB/s)(12.9TiB/300001msec)
    clat (usec): min=8, max=4994, avg=81.65, stdev=26.34
     lat (usec): min=9, max=4994, avg=81.70, stdev=26.36
    clat percentiles (usec):
     |  1.00th=[   58],  5.00th=[   60], 10.00th=[   62], 20.00th=[   63],
     | 30.00th=[   65], 40.00th=[   67], 50.00th=[   69], 60.00th=[   72],
     | 70.00th=[   77], 80.00th=[  117], 90.00th=[  126], 95.00th=[  133],
     | 99.00th=[  143], 99.50th=[  147], 99.90th=[  161], 99.95th=[  182],
     | 99.99th=[  302]
   bw (  MiB/s): min=18630, max=45522, per=100.00%, avg=45247.46, stdev=40.51, samples=17940
   iops        : min=149044, max=364181, avg=361974.08, stdev=324.04, samples=17940
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=73.34%, 250=26.64%
  lat (usec)   : 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=99.79%, sys=0.04%, ctx=5293, majf=0, minf=62401
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=108457907,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=44.1GiB/s (47.4GB/s), 44.1GiB/s-44.1GiB/s (47.4GB/s-47.4GB/s), io=12.9TiB (14.2TB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%