fio_test/log/128k/128k_rand_randread_6job_QD1.log
libpmem: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 6 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=6): err= 0: pid=41380: Fri Mar  5 04:10:37 2021
  read: IOPS=210k, BW=25.6GiB/s (27.5GB/s)(7694GiB/300001msec)
    clat (usec): min=3, max=1320, avg=28.10, stdev= 1.50
     lat (usec): min=3, max=1321, avg=28.12, stdev= 1.50
    clat percentiles (nsec):
     |  1.00th=[25728],  5.00th=[26240], 10.00th=[26496], 20.00th=[26752],
     | 30.00th=[27264], 40.00th=[27520], 50.00th=[27776], 60.00th=[28288],
     | 70.00th=[28800], 80.00th=[29312], 90.00th=[30080], 95.00th=[30592],
     | 99.00th=[31872], 99.50th=[32640], 99.90th=[34560], 99.95th=[37120],
     | 99.99th=[57600]
   bw (  MiB/s): min=22354, max=26397, per=100.00%, avg=26300.13, stdev=27.65, samples=3588
   iops        : min=178832, max=211178, avg=210400.77, stdev=221.21, samples=3588
  lat (usec)   : 4=0.01%, 20=0.01%, 50=99.98%, 100=0.02%, 250=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=99.85%, sys=0.01%, ctx=2571, majf=0, minf=12480
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=63029720,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=25.6GiB/s (27.5GB/s), 25.6GiB/s-25.6GiB/s (27.5GB/s-27.5GB/s), io=7694GiB (8261GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%