fio_test/log/128k/128k_rand_randrw_18job_QD1.log
libpmem: (g=0): rw=randrw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 18 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=18): err= 0: pid=46488: Fri Mar  5 10:07:47 2021
  read: IOPS=55.9k, BW=6992MiB/s (7332MB/s)(2048GiB/300001msec)
    clat (usec): min=3, max=583, avg=39.76, stdev= 3.87
     lat (usec): min=3, max=583, avg=39.80, stdev= 3.87
    clat percentiles (nsec):
     |  1.00th=[31872],  5.00th=[34048], 10.00th=[35072], 20.00th=[36608],
     | 30.00th=[37632], 40.00th=[38656], 50.00th=[39680], 60.00th=[40704],
     | 70.00th=[41216], 80.00th=[42752], 90.00th=[44288], 95.00th=[46336],
     | 99.00th=[49920], 99.50th=[51456], 99.90th=[58112], 99.95th=[64256],
     | 99.99th=[75264]
   bw (  MiB/s): min= 4181, max= 7700, per=100.00%, avg=6996.51, stdev=14.36, samples=10764
   iops        : min=33454, max=61607, avg=55966.01, stdev=114.84, samples=10764
  write: IOPS=55.9k, BW=6991MiB/s (7331MB/s)(2048GiB/300001msec); 0 zone resets
    clat (usec): min=74, max=1109, avg=277.53, stdev=54.32
     lat (usec): min=74, max=1109, avg=278.24, stdev=54.33
    clat percentiles (usec):
     |  1.00th=[  186],  5.00th=[  204], 10.00th=[  217], 20.00th=[  231],
     | 30.00th=[  245], 40.00th=[  258], 50.00th=[  269], 60.00th=[  285],
     | 70.00th=[  302], 80.00th=[  318], 90.00th=[  351], 95.00th=[  379],
     | 99.00th=[  437], 99.50th=[  461], 99.90th=[  519], 99.95th=[  545],
     | 99.99th=[  611]
   bw (  MiB/s): min= 4225, max= 7147, per=100.00%, avg=6995.67, stdev= 7.83, samples=10764
   iops        : min=33804, max=57177, avg=55957.91, stdev=62.64, samples=10764
  lat (usec)   : 4=0.01%, 20=0.01%, 50=49.51%, 100=0.50%, 250=17.19%
  lat (usec)   : 500=32.73%, 750=0.08%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=99.88%, sys=0.01%, ctx=1580, majf=0, minf=55240
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16780598,16778608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6992MiB/s (7332MB/s), 6992MiB/s-6992MiB/s (7332MB/s-7332MB/s), io=2048GiB (2199GB), run=300001-300001msec
  WRITE: bw=6991MiB/s (7331MB/s), 6991MiB/s-6991MiB/s (7331MB/s-7331MB/s), io=2048GiB (2199GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%